In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

1. How many distinct (different) actors' last names are there?

In [51]:
Q1 = pd.read_sql_query('SELECT COUNT(DISTINCT actor.last_name) AS Actors FROM actor', engine)
Q1.head()

   Actors
0     121

2. Add an additional column day_type with values 'weekend' and 'workday'  depending on the rental day of the week.

In [46]:
query2 = '''
SELECT 
    *
    , date_format(CONVERT(left(rental_date,23),date), '%%M') AS 'Month'
    , date_format(CONVERT(left(rental_date,23),date), '%%W') AS 'Weekday'
    , CASE
        WHEN 'Weekday' LIKE 'Sat%%' then 'Weekend'               
        WHEN 'Weekday' LIKE 'Sun%%' then 'Weekend'
        ELSE 'Week'
        END AS 'day_type'
FROM 
    sakila.rental 
LIMIT 
    20
;
'''

Q2 = pd.read_sql_query(query2, engine)
Q2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,Month,Weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,Tuesday,Week
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,May,Tuesday,Week
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,May,Tuesday,Week
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,May,Tuesday,Week
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,May,Tuesday,Week

3. Get all films with ARMAGEDDON in the title.

In [47]:
query3 = ''' 
SELECT 
    film.title  
FROM 
    film 
WHERE film.title LIKE '%%ARMAGEDDON%%' '''

Q3 = pd.read_sql_query(query3, engine)
Q3.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

4. Get 10 the longest films.

In [52]:
query4 = ''' 
SELECT 
    sakila.film.title  AS TOP_10_Longest_Films 
FROM 
    sakila.film 
ORDER BY
    sakila.film.length DESC 
LIMIT 
    10 
;
'''



Q4 = pd.read_sql_query(query4, engine)
Q4.head()

  TOP_10_Longest_Films
0       DARN FORRESTER
1         POND SEATTLE
2        CHICAGO NORTH
3        MUSCLE BRIGHT
4         WORST BANGER

5. How many films include Behind the Scenes content?

In [50]:
query5 = '''
SELECT 
    COUNT(*) AS 'Films with BtS Content' 
FROM 
    film
WHERE special_features LIKE '%%Behind the Scenes%%'; 
'''


Q5 = pd.read_sql_query(query5, engine)
Q5.head()

   Films with BtS Content
0                     538

6. Which kind of movies (rating) have a mean duration of more than two hours?

In [27]:
query6= '''

SELECT
    rating
    , AVG(length) AS Average_Length
FROM
    film
GROUP BY
    rating
HAVING
    Average_Length > 120
;
'''

Q6 = pd.read_sql_query(query6, engine)
Q6.head()

  rating  Average_Length
0  PG-13        120.4439

7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [53]:
query7 = '''SELECT 
    RANK() OVER(ORDER BY sakila.film.length DESC) AS 'Rank'
    ,sakila.film.title
    , sakila.film.length
    #rank
FROM
    sakila.film
WHERE
    length is not null
AND
    length > 0
ORDER BY
    length desc
;   '''

Q7 = pd.read_sql_query(query7, engine)
Q7.head()

   Rank           title  length
0     1   CHICAGO NORTH     185
1     1  CONTROL ANTHEM     185
2     1  DARN FORRESTER     185
3     1     GANGS PRIDE     185
4     1       HOME PITY     185